/* header format string for a crash on launch due to invalid code signature on a Mac App Store app */
"%@ can't be opened." = "Ohjelmaa %@ ei voida avata.";

/* header format string for a crash on launch due to missing software components */
"%@ cannot be opened because of a problem." = "Kohdetta ”%@” ei voida avata ongelman vuoksi.";

/* header format string for unknown problem type. */
"%@ experienced a problem." = "%@ kohtasi ongelman.";

/* header format string for crash while using a plugin */
"%@ quit unexpectedly while using the %@ plugin." = "%1$@ lopetti yllättäen toimintansa käyttäessään liitännäistä %2$@.";

/* header format string for a crash report */
"%@ quit unexpectedly." = "%@ lopetti yllättäen toimintansa.";

/* button title */
"Agree" = "Hyväksyn";

/* opt-in dialog text */
"By clicking \\U201CAgree\\U201D you agree that Apple may periodically collect and use this information as part of its support services and to improve its products and services. This information is collected anonymously. To learn more about Apple's Privacy Policy, see http://www.apple.com/legal/privacy." = "Osoittamalla ”Hyväksyn” hyväksyt, että Apple voi ajoittain kerätä ja käyttää näitä tietoja osana tukipalveluitaan ja tuotteidensa ja palveluidensa parantamiseen. Nämä tiedot kerätään nimettöminä. Lisätietoja Applen yksityisyydensuojakäytännöstä saat osoitteesta http://www.apple.com/fi/legal/privacy.";

/* further instructions for resolving problem of application missing software components */
"Check with the developer to make sure %@ works with this version of Mac OS X. You may need to reinstall the application. Be sure to install any available updates for the application and Mac OS X." = "Tarkista kehittäjältä, että %@ toimii tämän Mac OS X -version kanssa. Ohjelma on ehkä asennettava uudelleen. Muista asentaa kaikki saatavilla olevat päivitykset ohjelmaan ja Mac OS X:ään.";

/* instructions for case where user has not opted in yet */
"Click \\U201CSend to Apple\\U201D to submit the report to Apple. This information is collected anonymously." = "Jos haluat lähettää raportin Applelle, osoita Lähetä Applelle. Nämä tiedot kerätään nimettöminä.";

/* instructions for case where user has opted in for auto-submission and we can reopen the app */
"Click Reopen to open the application again. This report will be sent to Apple automatically." = "Avaa ohjelma uudelleen osoittamalla Avaa uudelleen. Raportti lähetetään Applelle automaattisesti.";

/* button title */
"Disagree" = "En hyväksy";

/* opt-in dialog suppression checkbox title */
"Don\\U2019t ask me again" = "Älä kysy enää";

/* button title */
"Don\\U2019t Send" = "Älä lähetä";

/* button title */
"Hide Details" = "Kätke yksityiskohdat";

/* button title */
"OK" = "OK";

/* window title - %@ is application name */
"Problem Report for %@" = "Ongelmaraportti kohteelle %@";

/* prompt for comments field */
"Provide any steps necessary to reproduce the problem." = "Luettele vaiheet, joilla ongelmatilanne voidaan toistaa.";

/* button title */
"Reopen" = "Avaa uudelleen";

/* button title */
"Send to Apple" = "Lähetä Applelle";

/* button title */
"Show Details" = "Näytä yksityiskohdat";

/* instructions for case where user has opted in for auto-submission and we can reopen the app */
"This report will be sent to Apple automatically." = "Raportti lähetetään Applelle automaattisesti.";

/* Error if system profile fails */
"Unable to gather system configuration information." = "Tietoja järjestelmän kokoonpanosta ei voida kerätä.";

/* further instructions for resolving problem of Mac App Store application invalid code signature */
"Using App Store, download %@ again." = "Lataa %@ uudelleen App Storen avulla.";

/* opt-in dialog title */
"You can help Apple improve its products by sending us anonymous diagnostic and usage information about your computer." = "Voit auttaa Applea parantamaan tuotteitaan lähettämällä meille nimettömiä vianmääritys- ja käyttötietoja tietokoneestasi.";

/* header format string for a hang report */
"You quit %@ because of a problem." = "Lopetit ohjelman %@ ongelman vuoksi.";

/* header format string for a panic report */
"You shut down the computer because of a problem." = "Sammutit koneen ongelman vuoksi.";

